Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70N20B.atdf
        <module name="AES" id="6149" version="W">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x4006C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="37"/>
              <param name="DMAC_ID_RX" value="38"/>
              <param name="INSTANCE_ID" value="56"/>
              <param name="CLOCK_ID" value="56"/>
            </parameters>
          </instance>
        </module>
        <module name="AFEC" id="11147" version="S">
          <instance name="AFEC0">
            <register-group address-space="base" name="AFEC0" name-in-module="AFEC" offset="0x4003C000"/>
            <signals>
              <signal pad="PA8" function="B" group="ADTRG"/>
              <signal pad="PD30" function="X1" group="AD" index="0"/>
              <signal pad="PA21" function="X1" group="AD" index="1"/>
              <signal pad="PA21" function="X1" group="PIODCEN" index="2"/>
              <signal pad="PB3" function="X1" group="AD" index="2"/>
              <signal pad="PB3" function="X1" group="WKUP" index="12"/>
              <signal pad="PE5" function="X1" group="AD" index="3"/>
              <signal pad="PE4" function="X1" group="AD" index="4"/>
              <signal pad="PB2" function="X1" group="AD" index="5"/>
              <signal pad="PA17" function="X1" group="AD" index="6"/>
              <signal pad="PA18" function="X1" group="AD" index="7"/>
              <signal pad="PA19" function="X1" group="AD" index="8"/>
              <signal pad="PA19" function="X1" group="WKUP" index="9"/>
              <signal pad="PA20" function="X1" group="AD" index="9"/>
              <signal pad="PA20" function="X1" group="WKUP" index="10"/>
              <signal pad="PB0" function="X1" group="AD" index="10"/>
              <signal pad="PB0" function="X1" group="RTCOUT" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="35"/>
              <param name="INSTANCE_ID" value="29"/>
              <param name="CLOCK_ID" value="29"/>
            </parameters>
          </instance>
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x40064000"/>
            <signals>
              <signal pad="PD9" function="C" group="ADTRG"/>
              <signal pad="PB1" function="X1" group="AD" index="0"/>
              <signal pad="PB1" function="X1" group="RTCOUT" index="1"/>
              <signal pad="PC13" function="X1" group="AD" index="1"/>
              <signal pad="PC15" function="X1" group="AD" index="2"/>
              <signal pad="PC12" function="X1" group="AD" index="3"/>
              <signal pad="PC29" function="X1" group="AD" index="4"/>
              <signal pad="PC30" function="X1" group="AD" index="5"/>
              <signal pad="PC31" function="X1" group="AD" index="6"/>
              <signal pad="PC26" function="X1" group="AD" index="7"/>
              <signal pad="PC27" function="X1" group="AD" index="8"/>
              <signal pad="PC0" function="X1" group="AD" index="9"/>
              <signal pad="PE3" function="X1" group="AD" index="10"/>
              <signal pad="PE0" function="X1" group="AD" index="11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="36"/>
              <param name="INSTANCE_ID" value="40"/>
              <param name="CLOCK_ID" value="40"/>
            </parameters>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="ZK">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0940"/>
          </instance>
        </module>
        <module name="DACC" id="11246" version="D">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD0" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="30"/>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="EFC" id="6450" version="X">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="J">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="HSMCI" id="6449" version="R">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA25" function="D" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="0"/>
              <param name="DMAC_ID_TX" value="0"/>
              <param name="INSTANCE_ID" value="18"/>
              <param name="CLOCK_ID" value="18"/>
            </parameters>
          </instance>
        </module>
        <module name="I2SC" id="11241" version="N">
          <instance name="I2SC0">
            <register-group address-space="base" name="I2SC0" name-in-module="I2SC" offset="0x4008C000"/>
            <signals>
              <signal pad="PA1" function="D" group="CK"/>
              <signal pad="PA16" function="D" group="DI" index="0"/>
              <signal pad="PA30" function="D" group="DO" index="0"/>
              <signal pad="PA0" function="D" group="MCK"/>
              <signal pad="PA15" function="D" group="WS"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="69"/>
              <param name="CLOCK_ID" value="69"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="11105" version="H">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="ISI" id="6350" version="K">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0x4004C000"/>
            <signals>
              <signal pad="PD22" function="D" group="D" index="0"/>
              <signal pad="PD21" function="D" group="D" index="1"/>
              <signal pad="PB3" function="D" group="D" index="2"/>
              <signal pad="PA9" function="B" group="D" index="3"/>
              <signal pad="PA5" function="B" group="D" index="4"/>
              <signal pad="PD11" function="D" group="D" index="5"/>
              <signal pad="PD12" function="D" group="D" index="6"/>
              <signal pad="PA27" function="D" group="D" index="7"/>
              <signal pad="PD27" function="D" group="D" index="8"/>
              <signal pad="PD28" function="D" group="D" index="9"/>
              <signal pad="PD30" function="D" group="D" index="10"/>
              <signal pad="PD31" function="D" group="D" index="11"/>
              <signal pad="PD24" function="D" group="HSYNC"/>
              <signal pad="PA24" function="D" group="PCK"/>
              <signal pad="PD25" function="D" group="VSYNC"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11282" version="L">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x40088000"/>
