Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70N20B.atdf
        <register caption="Mode Register" name="QSPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Serial Memory Mode" mask="0x00000001" name="SMM" values="QSPI_MR__SMM"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000002" name="LLB" values="QSPI_MR__LLB"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000004" name="WDRBT" values="QSPI_MR__WDRBT"/>
          <bitfield caption="Chip Select Mode" mask="0x00000030" name="CSMODE" values="QSPI_MR__CSMODE"/>
          <bitfield caption="Number Of Bits Per Transfer" mask="0x00000F00" name="NBBITS" values="QSPI_MR__NBBITS"/>
          <bitfield caption="Delay Between Consecutive Transfers" mask="0x00FF0000" name="DLYBCT"/>
          <bitfield caption="Minimum Inactive QCS Delay" mask="0xFF000000" name="DLYCS"/>
        </register>
        <register caption="Receive Data Register" name="QSPI_RDR" offset="0x08" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD"/>
        </register>
        <register caption="Transmit Data Register" name="QSPI_TDR" offset="0x0C" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD"/>
        </register>
        <register caption="Status Register" name="QSPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading SPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing SPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing SPI_TDR)" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise (cleared on read)" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Status (cleared on read)" mask="0x00000400" name="INSTRE"/>
          <bitfield caption="QSPI Enable Status" mask="0x01000000" name="QSPIENS"/>
        </register>
        <register caption="Interrupt Enable Register" name="QSPI_IER" offset="0x14" rw="W" size="4" atomic-op="set:QSPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise Interrupt Enable" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status Interrupt Enable" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Interrupt Enable" mask="0x00000400" name="INSTRE"/>
        </register>
        <register caption="Interrupt Disable Register" name="QSPI_IDR" offset="0x18" rw="W" size="4" atomic-op="clear:QSPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise Interrupt Disable" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status Interrupt Disable" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Interrupt Disable" mask="0x00000400" name="INSTRE"/>
        </register>
        <register caption="Interrupt Mask Register" name="QSPI_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:QSPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise Interrupt Mask" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status Interrupt Mask" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Interrupt Mask" mask="0x00000400" name="INSTRE"/>
        </register>
        <register caption="Serial Clock Register" name="QSPI_SCR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Clock Polarity" mask="0x00000001" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x00000002" name="CPHA"/>
          <bitfield caption="Serial Clock Baud Rate" mask="0x0000FF00" name="SCBR"/>
          <bitfield caption="Delay Before QSCK" mask="0x00FF0000" name="DLYBS"/>
        </register>
        <register caption="Instruction Address Register" name="QSPI_IAR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Instruction Code Register" name="QSPI_ICR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Instruction Code" mask="0x000000FF" name="INST"/>
          <bitfield caption="Option Code" mask="0x00FF0000" name="OPT"/>
        </register>
        <register caption="Instruction Frame Register" name="QSPI_IFR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Width of Instruction Code, Address, Option Code and Data" mask="0x00000007" name="WIDTH" values="QSPI_IFR__WIDTH"/>
          <bitfield caption="Instruction Enable" mask="0x00000010" name="INSTEN"/>
          <bitfield caption="Address Enable" mask="0x00000020" name="ADDREN"/>
          <bitfield caption="Option Enable" mask="0x00000040" name="OPTEN"/>
          <bitfield caption="Data Enable" mask="0x00000080" name="DATAEN"/>
          <bitfield caption="Option Code Length" mask="0x00000300" name="OPTL" values="QSPI_IFR__OPTL"/>
          <bitfield caption="Address Length" mask="0x00000400" name="ADDRL" values="QSPI_IFR__ADDRL"/>
          <bitfield caption="Data Transfer Type" mask="0x00003000" name="TFRTYP" values="QSPI_IFR__TFRTYP"/>
          <bitfield caption="Continuous Read Mode" mask="0x00004000" name="CRM" values="QSPI_IFR__CRM"/>
          <bitfield caption="Number Of Dummy Cycles" mask="0x001F0000" name="NBDUM"/>
        </register>
        <register caption="Scrambling Mode Register" name="QSPI_SMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Scrambling/Unscrambling Enable" mask="0x00000001" name="SCREN" values="QSPI_SMR__SCREN"/>
          <bitfield caption="Scrambling/Unscrambling Random Value Disable" mask="0x00000002" name="RVDIS"/>
        </register>
        <register caption="Scrambling Key Register" name="QSPI_SKR" offset="0x44" rw="W" size="4">
          <bitfield caption="Scrambling User Key" mask="0xFFFFFFFF" name="USRK"/>
        </register>
        <register caption="Write Protection Mode Register" name="QSPI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="QSPI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="QSPI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="QSPI_MR__SMM">
        <value caption="The QSPI is in SPI mode." name="SPI" value="0"/>
        <value caption="The QSPI is in Serial Memory mode." name="MEMORY" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__LLB">
        <value caption="Local loopback path disabled." name="DISABLED" value="0"/>
        <value caption="Local loopback path enabled." name="ENABLED" value="1"/>
      </value-group>
