Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/atdf/ATSAMS70N20B.atdf
        <register caption="Device Frame Number Register" name="USBHS_DEVFNUM" offset="0x0020" rw="R" size="4">
          <bitfield caption="Micro Frame Number" mask="0x00000007" name="MFNUM"/>
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Number CRC Error" mask="0x00008000" name="FNCERR"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 0" name="USBHS_DEVEPTCFG" offset="0x100" rw="RW" size="4" count="10">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="USBHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="USBHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="USBHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="USBHS_DEVEPTCFG__EPTYPE"/>
          <bitfield caption="Number of transactions per microframe for isochronous endpoint" mask="0x00006000" name="NBTRANS" values="USBHS_DEVEPTCFG__NBTRANS"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 0" name="USBHS_DEVEPTISR" offset="0x130" rw="R" size="4" count="10">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 0" name="USBHS_DEVEPTICR" offset="0x160" rw="W" size="4" count="10" atomic-op="clear:USBHS_DEVEPTISR">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 0" name="USBHS_DEVEPTIFR" offset="0x190" rw="W" size="4" count="10" atomic-op="set:USBHS_DEVEPTISR">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 0" name="USBHS_DEVEPTIMR" offset="0x1C0" rw="R" size="4" count="10">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Enable Register (n = 0) 0" name="USBHS_DEVEPTIER" offset="0x1F0" rw="W" size="4" count="10" atomic-op="set:USBHS_DEVEPTIMR">
          <bitfield caption="Transmitted IN Data Interrupt Enable" mask="0x00000001" name="TXINES"/>
          <bitfield caption="Received OUT Data Interrupt Enable" mask="0x00000002" name="RXOUTES"/>
          <bitfield caption="Received SETUP Interrupt Enable" mask="0x00000004" name="RXSTPES"/>
          <bitfield caption="NAKed OUT Interrupt Enable" mask="0x00000008" name="NAKOUTES"/>
          <bitfield caption="NAKed IN Interrupt Enable" mask="0x00000010" name="NAKINES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFES"/>
          <bitfield caption="STALLed Interrupt Enable" mask="0x00000040" name="STALLEDES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETES"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBKS"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCONS"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Enable" mask="0x00010000" name="EPDISHDMAS"/>
          <bitfield caption="NYET Token Disable Enable" mask="0x00020000" name="NYETDISS"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
          <bitfield caption="STALL Request Enable" mask="0x00080000" name="STALLRQS"/>
        </register>
        <register caption="Device Endpoint Disable Register (n = 0) 0" name="USBHS_DEVEPTIDR" offset="0x220" rw="W" size="4" count="10" atomic-op="clear:USBHS_DEVEPTIMR">
          <bitfield caption="Transmitted IN Interrupt Clear" mask="0x00000001" name="TXINEC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTEC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPEC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTEC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINEC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFEC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDEC"/>
          <bitfield caption="Shortpacket Interrupt Clear" mask="0x00000080" name="SHORTPACKETEC"/>
          <bitfield caption="Number of Busy Banks Interrupt Clear" mask="0x00001000" name="NBUSYBKEC"/>
          <bitfield caption="FIFO Control Clear" mask="0x00004000" name="FIFOCONC"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request Clear" mask="0x00010000" name="EPDISHDMAC"/>
          <bitfield caption="NYET Token Disable Clear" mask="0x00020000" name="NYETDISC"/>
          <bitfield caption="STALL Request Clear" mask="0x00080000" name="STALLRQC"/>
        </register>
        <register-group caption="Device DMA Channel Next Descriptor Address Register (n = 1)" offset="0x310" name="USBHS_DEVDMA" size="16" count="7" name-in-module="USBHS_DEVDMA"/>
        <register caption="Host General Control Register" name="USBHS_HSTCTRL" offset="0x0400" rw="RW" size="4">
          <bitfield caption="Start of Frame Generation Enable" mask="0x00000100" name="SOFE"/>
          <bitfield caption="Send USB Reset" mask="0x00000200" name="RESET"/>
          <bitfield caption="Send USB Resume" mask="0x00000400" name="RESUME"/>
          <bitfield caption="Mode Configuration" mask="0x00003000" name="SPDCONF" values="USBHS_HSTCTRL__SPDCONF"/>
        </register>
        <register caption="Host Global Interrupt Status Register" name="USBHS_HSTISR" offset="0x0404" rw="R" size="4">
          <bitfield caption="Device Connection Interrupt" mask="0x00000001" name="DCONNI"/>
          <bitfield caption="Device Disconnection Interrupt" mask="0x00000002" name="DDISCI"/>
          <bitfield caption="USB Reset Sent Interrupt" mask="0x00000004" name="RSTI"/>
          <bitfield caption="Downstream Resume Sent Interrupt" mask="0x00000008" name="RSMEDI"/>
          <bitfield caption="Upstream Resume Received Interrupt" mask="0x00000010" name="RXRSMI"/>
          <bitfield caption="Host Start of Frame Interrupt" mask="0x00000020" name="HSOFI"/>
          <bitfield caption="Host Wake-Up Interrupt" mask="0x00000040" name="HWUPI"/>
          <bitfield caption="Pipe 0 Interrupt" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="Pipe 5 Interrupt" mask="0x00002000" name="PEP_5"/>
          <bitfield caption="Pipe 6 Interrupt" mask="0x00004000" name="PEP_6"/>
          <bitfield caption="Pipe 7 Interrupt" mask="0x00008000" name="PEP_7"/>
          <bitfield caption="Pipe 8 Interrupt" mask="0x00010000" name="PEP_8"/>
          <bitfield caption="Pipe 9 Interrupt" mask="0x00020000" name="PEP_9"/>
          <bitfield caption="Pipe 10 Interrupt" mask="0x00040000" name="PEP_10"/>
          <bitfield caption="Pipe 11 Interrupt" mask="0x00080000" name="PEP_11"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Host Global Interrupt Clear Register" name="USBHS_HSTICR" offset="0x0408" rw="W" size="4" atomic-op="clear:USBHS_HSTISR">
          <bitfield caption="Device Connection Interrupt Clear" mask="0x00000001" name="DCONNIC"/>
          <bitfield caption="Device Disconnection Interrupt Clear" mask="0x00000002" name="DDISCIC"/>
          <bitfield caption="USB Reset Sent Interrupt Clear" mask="0x00000004" name="RSTIC"/>
          <bitfield caption="Downstream Resume Sent Interrupt Clear" mask="0x00000008" name="RSMEDIC"/>
          <bitfield caption="Upstream Resume Received Interrupt Clear" mask="0x00000010" name="RXRSMIC"/>
          <bitfield caption="Host Start of Frame Interrupt Clear" mask="0x00000020" name="HSOFIC"/>
          <bitfield caption="Host Wake-Up Interrupt Clear" mask="0x00000040" name="HWUPIC"/>
        </register>
        <register caption="Host Global Interrupt Set Register" name="USBHS_HSTIFR" offset="0x040C" rw="W" size="4" atomic-op="set:USBHS_HSTISR">
          <bitfield caption="Device Connection Interrupt Set" mask="0x00000001" name="DCONNIS"/>
          <bitfield caption="Device Disconnection Interrupt Set" mask="0x00000002" name="DDISCIS"/>
          <bitfield caption="USB Reset Sent Interrupt Set" mask="0x00000004" name="RSTIS"/>
          <bitfield caption="Downstream Resume Sent Interrupt Set" mask="0x00000008" name="RSMEDIS"/>
          <bitfield caption="Upstream Resume Received Interrupt Set" mask="0x00000010" name="RXRSMIS"/>
          <bitfield caption="Host Start of Frame Interrupt Set" mask="0x00000020" name="HSOFIS"/>
          <bitfield caption="Host Wake-Up Interrupt Set" mask="0x00000040" name="HWUPIS"/>
          <bitfield caption="DMA Channel 1 Interrupt Set" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Set" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Set" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Set" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Set" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Set" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Set" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Host Global Interrupt Mask Register" name="USBHS_HSTIMR" offset="0x0410" rw="R" size="4">
          <bitfield caption="Device Connection Interrupt Enable" mask="0x00000001" name="DCONNIE"/>
          <bitfield caption="Device Disconnection Interrupt Enable" mask="0x00000002" name="DDISCIE"/>
          <bitfield caption="USB Reset Sent Interrupt Enable" mask="0x00000004" name="RSTIE"/>
          <bitfield caption="Downstream Resume Sent Interrupt Enable" mask="0x00000008" name="RSMEDIE"/>
          <bitfield caption="Upstream Resume Received Interrupt Enable" mask="0x00000010" name="RXRSMIE"/>
          <bitfield caption="Host Start of Frame Interrupt Enable" mask="0x00000020" name="HSOFIE"/>
          <bitfield caption="Host Wake-Up Interrupt Enable" mask="0x00000040" name="HWUPIE"/>
          <bitfield caption="Pipe 0 Interrupt Enable" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt Enable" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt Enable" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt Enable" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt Enable" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="Pipe 5 Interrupt Enable" mask="0x00002000" name="PEP_5"/>
          <bitfield caption="Pipe 6 Interrupt Enable" mask="0x00004000" name="PEP_6"/>
          <bitfield caption="Pipe 7 Interrupt Enable" mask="0x00008000" name="PEP_7"/>
          <bitfield caption="Pipe 8 Interrupt Enable" mask="0x00010000" name="PEP_8"/>
          <bitfield caption="Pipe 9 Interrupt Enable" mask="0x00020000" name="PEP_9"/>
          <bitfield caption="Pipe 10 Interrupt Enable" mask="0x00040000" name="PEP_10"/>
          <bitfield caption="Pipe 11 Interrupt Enable" mask="0x00080000" name="PEP_11"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Enable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Enable" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Enable" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Host Global Interrupt Disable Register" name="USBHS_HSTIDR" offset="0x0414" rw="W" size="4" atomic-op="clear:USBHS_HSTIMR">
          <bitfield caption="Device Connection Interrupt Disable" mask="0x00000001" name="DCONNIEC"/>
          <bitfield caption="Device Disconnection Interrupt Disable" mask="0x00000002" name="DDISCIEC"/>
          <bitfield caption="USB Reset Sent Interrupt Disable" mask="0x00000004" name="RSTIEC"/>
          <bitfield caption="Downstream Resume Sent Interrupt Disable" mask="0x00000008" name="RSMEDIEC"/>
          <bitfield caption="Upstream Resume Received Interrupt Disable" mask="0x00000010" name="RXRSMIEC"/>
          <bitfield caption="Host Start of Frame Interrupt Disable" mask="0x00000020" name="HSOFIEC"/>
          <bitfield caption="Host Wake-Up Interrupt Disable" mask="0x00000040" name="HWUPIEC"/>
          <bitfield caption="Pipe 0 Interrupt Disable" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt Disable" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt Disable" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt Disable" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt Disable" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="Pipe 5 Interrupt Disable" mask="0x00002000" name="PEP_5"/>
          <bitfield caption="Pipe 6 Interrupt Disable" mask="0x00004000" name="PEP_6"/>
          <bitfield caption="Pipe 7 Interrupt Disable" mask="0x00008000" name="PEP_7"/>
          <bitfield caption="Pipe 8 Interrupt Disable" mask="0x00010000" name="PEP_8"/>
          <bitfield caption="Pipe 9 Interrupt Disable" mask="0x00020000" name="PEP_9"/>
          <bitfield caption="Pipe 10 Interrupt Disable" mask="0x00040000" name="PEP_10"/>
          <bitfield caption="Pipe 11 Interrupt Disable" mask="0x00080000" name="PEP_11"/>
          <bitfield caption="DMA Channel 1 Interrupt Disable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Disable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Disable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Disable" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Disable" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Disable" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Disable" mask="0x80000000" name="DMA_7"/>
        </register>
